<a href="https://colab.research.google.com/github/shashipunu29/eda-case-study/blob/main/Copy_of_DSC_26_Kaggle_Demo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import os
os.environ['KAGGLE_CONFIG_DIR'] = '/content/drive/MyDrive/DSC26 Kaggle'

In [ ]:
%cd /content/drive/MyDrive/DSC26 Kaggle

/content/drive/MyDrive/DSC26 Kaggle

In [ ]:
!kaggle competitions download -c titanic

Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.12 / client 1.5.4)
Downloading train.csv to /content/drive/MyDrive/DSC26 Kaggle
  0% 0.00/59.8k [00:00<?, ?B/s]
100% 59.8k/59.8k [00:00<00:00, 7.95MB/s]
Downloading gender_submission.csv to /content/drive/MyDrive/DSC26 Kaggle
  0% 0.00/3.18k [00:00<?, ?B/s]
100% 3.18k/3.18k [00:00<00:00, 414kB/s]
Downloading test.csv to /content/drive/MyDrive/DSC26 Kaggle
  0% 0.00/28.0k [00:00<?, ?B/s]
100% 28.0k/28.0k [00:00<00:00, 3.57MB/s]

In [ ]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/DSC26 Kaggle/train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
100*df.isnull().sum()/df.shape[0]

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [ ]:
df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [ ]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [ ]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
df.Embarked.fillna('S', inplace = True)

In [ ]:
a = df.Age.median()
a

28.0

In [ ]:
df.Age.fillna(a, inplace = True)

In [ ]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [ ]:
df.Survived.value_counts()/df.shape[0]

0    0.616162
1    0.383838
Name: Survived, dtype: float64

Here we are skipping certain pre-processing steps, so as to save time but when you will be working on this, you are required to follow all the steps properly.

In [ ]:
df.Sex.replace(['male', 'female'], [1,0], inplace = True)
df.Embarked.replace(['S', 'C','Q'], [0,1,2], inplace = True)

In [ ]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         0
1         1       1    0  38.0      1      0  71.2833         1
2         1       3    0  26.0      0      0   7.9250         0
3         1       1    0  35.0      1      0  53.1000         0
4         0       3    1  35.0      0      0   8.0500         0

In [ ]:
X = df.drop("Survived", axis =1)
y = df.Survived

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn import metrics

logreg = LogisticRegression()
logreg.fit(X,y)

y_pred = logreg.predict(X)

print("Sensitivity/Recall", metrics.recall_score(y, y_pred))

Sensitivity/Recall 0.716374269005848

In [ ]:
test = pd.read_csv('/content/drive/MyDrive/DSC26 Kaggle/test.csv')
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
test_copy = test.copy()

In [ ]:
test.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [ ]:
test.isnull().sum()

Pclass       0
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     0
dtype: int64

In [ ]:
a = test.Age.median()
b = test.Fare.median()

In [ ]:
test.Age.fillna(a, inplace = True)
test.Fare.fillna(b, inplace = True)

In [ ]:
test.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [ ]:
test.Sex.replace(['male', 'female'], [1,0], inplace = True)
test.Embarked.replace(['S', 'C','Q'], [0,1,2], inplace = True)

In [ ]:
test.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  34.5      0      0   7.8292         2
1       3    0  47.0      1      0   7.0000         0
2       2    1  62.0      0      0   9.6875         2
3       3    1  27.0      0      0   8.6625         0
4       3    0  22.0      1      1  12.2875         0

In [ ]:
X.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked'], dtype='object')

In [ ]:
pred = logreg.predict(test)

In [ ]:
test_copy['Survived'] = pred

In [ ]:
test_copy.head()

   PassengerId  Pclass  ... Embarked Survived
0          892       3  ...        Q        0
1          893       3  ...        S        0
2          894       2  ...        Q        0
3          895       3  ...        S        0
4          896       3  ...        S        1

[5 rows x 12 columns]

In [ ]:
submit = test_copy[['PassengerId', 'Survived']]
submit.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [ ]:
submit.to_csv("submit.csv", index = False)